Побудувати три класи (базовий і 2 нащадка),
що описують деяких працівників з погодинною оплатою (один з нащадків) 
і фіксованою оплатою (другий нащадок). Описати в базовому класі 
абстрактний метод для розрахунку середньомісячної заробітної плати. 
Для «почасових» формула для розрахунку така: 
    «середньомісячна заробітна плата = 20.8 * 8 * погодинну ставку», 
    для працівників з фіксованою оплатою «середньомісячна заробітна 
    плата = фіксованою місячної оплати».
    a) Упорядкувати всю послідовність працівників по спадаючій середньомісячного заробітку. 
        При збігу зарплати - упорядковувати дані за алфавітом по імені. 
        Вивести ідентифікатор працівника, ім'я та середньомісячний заробіток 
        для всіх елементів списку.
    b) Вивести перші 5 імен працівників з отриманого в пункті а) списку.
    c) Вивести останні 3 ідентифікатора працівників з отриманого в пункті а) списку.
    d) Організувати запис і читання колекції у / з файл.
    e) Організувати обробку некоректного формату вхідного файлу.
